
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 10 to change, 7 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;database&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;pass&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
* Replace
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;notifications&#34;]
  * module.postgresql.azurerm_resource_group.rg[0]
  * module.postgresql.null_resource.set-user-permissions-additionaldbs[&#34;notifications&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-DATABASE/ecbc15d9f5f343c8b48d284051f6249e"
        name                    = "notification-service-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-HOST/371556d3a0354c5f97898d20c6800729"
        name                    = "notification-service-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-PASS/2d86cbad29aa46519c01ff7538394daf"
        name                    = "notification-service-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-PORT/a1dfb099b11f43fb91feb7a50dda6a0c"
        name                    = "notification-service-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-POSTGRES-FLEXIBLE-USER/6cac12c3132a40b585c955d9389c6fce"
        name                    = "notification-service-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["database"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-database/d77bbd705a7d49f4be421f4c6cfaa043"
        name                    = "notification-service-staging-db-flexible-database"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-host/b4f9336e3f264127b9016272c873e815"
        name                    = "notification-service-staging-db-flexible-host"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["pass"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-pass/357dc3b29c754d51814bb9a53931144e"
        name                    = "notification-service-staging-db-flexible-pass"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-port/f42e2d307ea4410f858f5b40ac609379"
        name                    = "notification-service-staging-db-flexible-port"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-02-06T10:26:32Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-service-staging-db-flexible-user/7a0ead168c6641e695c257c41cf56a99"
        name                    = "notification-service-staging-db-flexible-user"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "notification-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "reform-scan-notification-service-flexible-postgres-db-v15-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-notification-service-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/reform-scan-notification-service-flexible-postgres-db-v15-aat" -> (known after apply)
      ~ name                          = "reform-scan-notification-service-flexible-postgres-db-v15-aat" -> "reform-scan-notification-service-flexible-db-v15-aat" # forces replacement
      ~ public_network_access_enabled = false -> (known after apply)
      ~ resource_group_name           = "reform-scan-notification-service-flexible-postgres-db-v15-data-aat" -> "reform-scan-notification-service-flexible-db-v15-data-aat" # forces replacement
        tags                          = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-notification-service-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/reform-scan-notification-service-flexible-postgres-db-v15-aat/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ resource_group_name = "reform-scan-notification-service-flexible-postgres-db-v15-data-aat" -> "reform-scan-notification-service-flexible-db-v15-data-aat" # forces replacement
      ~ server_name         = "reform-scan-notification-service-flexible-postgres-db-v15-aat" -> "reform-scan-notification-service-flexible-db-v15-aat" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-notification-service-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/reform-scan-notification-service-flexible-postgres-db-v15-aat/administrators/ca6d5085-485a-417d-8480-c3cefa29df31" -> (known after apply)
      ~ resource_group_name = "reform-scan-notification-service-flexible-postgres-db-v15-data-aat" -> "reform-scan-notification-service-flexible-db-v15-data-aat" # forces replacement
      ~ server_name         = "reform-scan-notification-service-flexible-postgres-db-v15-aat" -> "reform-scan-notification-service-flexible-db-v15-aat" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-notification-service-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/reform-scan-notification-service-flexible-postgres-db-v15-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-notification-service-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/reform-scan-notification-service-flexible-postgres-db-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["notifications"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-notification-service-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/reform-scan-notification-service-flexible-postgres-db-v15-aat/databases/notifications" -> (known after apply)
        name      = "notifications"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-notification-service-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/reform-scan-notification-service-flexible-postgres-db-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.azurerm_resource_group.rg[0] must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-notification-service-flexible-postgres-db-v15-data-aat" -> (known after apply)
      ~ name     = "reform-scan-notification-service-flexible-postgres-db-v15-data-aat" -> "reform-scan-notification-service-flexible-db-v15-data-aat" # forces replacement
        tags     = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/reform-scan-notification-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.null_resource.set-user-permissions-additionaldbs["notifications"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "8371941585309495190" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "reform-scan-notification-service-flexible-postgres-db-v15" -> "reform-scan-notification-service-flexible-db-v15"
            # (3 unchanged elements hidden)
        }
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1538,"Program":"tfcmt","SHA1":"","Vars":{}} -->